DataProcessors/RemovingUsedEDPackagesFiles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>RemovingUsedEDPackagesFiles</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/EDPackagesStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>EDPackagesStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToUnpacking</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Canceled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PreparedToSending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unpacked</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnpackedDocumentsNotProcessed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/EDPackage.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>EDPackage</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CounterpartyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalUID</Name>
					<Comment>Unique identifier of the object in the external system</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataEncrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RFBankClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Direction</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDDirections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptionCertificate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackagesStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ElectronicDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OwnerObject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteDataEncrypted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteEncryptionCertificate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElectronicDocument</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/RemovingUsedEDPackagesFiles/Forms/Form/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// GENERAL PURPOSE PROCEDURES AND FUNCTIONS

&AtServer
Procedure FillTableFilesOfPackageED()
	
	ProcessedPackages.Clear();
	
	PackagesQuery = New Query;
	RemovableStatusesPackages = New ValueList;
	RemovableStatusesPackages.Add(Enums.EDPackagesStatuses.Canceled);
	RemovableStatusesPackages.Add(Enums.EDPackagesStatuses.Delivered);
	RemovableStatusesPackages.Add(Enums.EDPackagesStatuses.Unpacked);
	PackagesQuery.SetParameter("PackageStatus", RemovableStatusesPackages);
	
	PackagesQuery.Text =
	"SELECT DISTINCT ALLOWED
	|	EDAttachedFiles.Ref AS Document,
	|	EDAttachedFiles.FileOwner.PackageStatus AS Status,
	|	FALSE AS Selected,
	|	EDAttachedFiles.CreationDate AS DateReceived,
	|	EDAttachedFiles.FileOwner.Company AS Company,
	|	EDAttachedFiles.FileOwner.Counterparty AS Counterparty,
	|	EDAttachedFiles.FileOwner.Direction AS Direction
	|FROM
	|	Catalog.EDAttachedFiles AS EDAttachedFiles
	|WHERE
	|	EDAttachedFiles.FileOwner REFS Document.EDPackage
	|	AND EDAttachedFiles.DeletionMark = FALSE
	|	AND CAST(EDAttachedFiles.FileOwner AS Document.EDPackage).PackageStatus IN (&PackageStatus)";
	
	ValueToFormAttribute(PackagesQuery.Execute().Unload(), "ProcessedPackages");
	
EndProcedure

&AtServer
Procedure DeleteData()
	
	For Each RemovalLine IN ProcessedPackages Do
		If RemovalLine.Selected Then
			RemovalObject = RemovalLine.Document.GetObject();
			RemovalObject.DeletionMark = True;
			RemovalObject.Write();
		EndIf;
	EndDo;
	
EndProcedure

&AtServer
Procedure SetCheckBoxes(InstallationOption)
	
	For Each String IN ProcessedPackages Do
		String.Selected = InstallationOption;
	EndDo;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - Form commands actions

&AtClient
Procedure UncheckAll(Command)
	
	SetCheckBoxes(False);
	
EndProcedure

&AtClient
Procedure SelectAll(Command)
	
	SetCheckBoxes(True);
	
EndProcedure

&AtClient
Procedure MarkToDeleteMarkedPED(Command)
	
	DeleteData();
	RefreshDataTables(Undefined);
	
EndProcedure

&AtClient
Procedure RefreshDataTables(Command)
	
	FillTableFilesOfPackageED();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM FIELD EVENT HANDLERS

&AtClient
Procedure ProcessedPackagesSelection(Item, SelectedRow, Field, StandardProcessing)
	
	StandardProcessing = False;
	ElectronicDocumentsServiceClient.OpenEDForViewing(Items.ProcessedPackages.CurrentData.Document);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillTableFilesOfPackageED();
	
EndProcedure
